<?php

namespace Larabookir\Gateway\Zibal;

use Larabookir\Gateway\Exceptions\BankException;

class ZibalException extends BankException
{
    public static $errors = array(
        -2 => 'خطای داخلی',
        -1 => 'در انتظار پردخت',
        2 => 'پرداخت شده - تاییدنشده',
        3 => 'تراکنش توسط کاربر لغو شد.',
        4 => 'شماره کارت نامعتبر می‌باشد.',
        5 => 'موجودی حساب کافی نمی‌باشد.',
        6 => 'رمز واردشده اشتباه می‌باشد.',
        7 => 'تعداد درخواست‌ها بیش از حد مجاز می‌باشد.',
        8 => 'تعداد پرداخت اینترنتی روزانه بیش از حد مجاز می‌باشد.',
        9 => 'مبلغ پرداخت اینترنتی روزانه بیش از حد مجاز می‌باشد.',
        10 => 'صادرکننده‌ی کارت نامعتبر می‌باشد.',
        11 => '‌خطای سوییچ',
        12 => 'کارت قابل دسترسی نمی‌باشد.',
        15 => 'تراکنش استرداد شده',
        16 => 'تراکنش در حال استرداد',
        18 => 'تراکنش ریورس شده',
        102 => 'merchantیافت نشد.',
        103 => 'merchantغیرفعال',
        104 => 'merchantنامعتبر',
        105 => 'amountبایستی بزرگتر از 1,000 ریال باشد.',
        106 => 'callbackUrlنامعتبر می‌باشد. (شروع با http و یا https)',
        113 => 'amountمبلغ تراکنش از سقف میزان تراکنش بیشتر است.',
        114 => 'کدملی ارسالی نامعتبر است.',
        201 => 'قبلا تایید شده',
        202 => 'سفارش پرداخت نشده یا ناموفق بوده است.',
        203 => 'trackId نامعتبر می‌باشد.',
    );

    public function __construct($errorId)
    {
        $this->errorId = intval($errorId);

        parent::__construct((isset(self::$errors[$this->errorId]) ? self::$errors[$this->errorId] : '').' #'.$this->errorId, $this->errorId);
    }
}
